from flask import Flask, render_template

app = Flask(__name__)

data = {
    "home": {
        "image": "club1.jpg",
        "title": "MUTINY",
        "subtitle": "أهلاً بك في أفضل نادي في fC26"
    },
    "about": {
        "image": "club.jpg",
        "paragraphs": [
            "MUTINY، النادي صاحب الفكر المستقبلي الذي سيغيّر معنى البرو كلوب، وذلك لا يقتصر فقط على تصميم النادي وأزياء اللاعبين، بل وأيضًا على اللاعبين أنفسهم، ومرافق النادي، وكذلك لاعبو الذكاء الاصطناعي في الفريق (BOTS)، وإحدى هذه الأفكار هي إنشاء هذا الموقع الخاص بالنادي.",
"نحن لا نتبع القواعد... نحن نتمرّد."      
في هذا النادي، نحن لا نسير خلف أحد،      
نحن نكسر القواعد، ونخلق طريقنا الخاص.            
وُلد MUTINY من رحم الفوضى    
اسمنا يعني التمرّد، العصيان، ورفض الخضوع.      
لسنا مجرد نادٍ، بل فكرة:      
أن تقف ضد التيار، أن تلعب بأسلوبك، وأن تفرض هيبتك دون إذن أحد.      
نحن الفريق الذي لا يخشى المجازفة،      
نُهاجم بعزيمة لا تنكسر،      
وندافع بشراسة لا تُقهر.
            "MUTINY ليس مجرد نادي..."
        ]
    },
    "achievements": {
        "image": "trophy.jpg",
        "text": "نادي MUTINY معكم يصنع التاريخ بإذن الله تعالى"
    },
    "stats": {
        "image": "stats.jpg",
        "goals": [
            "1- بـ ( ) هدف",
            "2- بـ ( ) هدف",
            "3- بـ ( ) هدف"
        ],
        "assists": [
            "1- بـ ( ) صناعة",
            "2- بـ ( ) صناعة",
            "3- بـ ( ) صناعة"
        ],
        "man_of_match": [
            "1- ( ) رجل المباراة ( ) مرة",
            "2- ( ) رجل المباراة ( ) مرة",
            "3- ( ) رجل المباراة ( ) مرة"
        ]
    },
    "presidents": {
        "image": "president.jpg",
        "names": [
            {"name": "سالم الشهري", "id": "sa-1-0"},
            {"name": "إبراهيم الشهري", "id": "IBRA_SH47"},
            {"name": "عبدالله الشهري", "id": "ad_7ull"},
            {"name": "أحمد الشهري", "id": "NINJA_AL507"}
        ]
    },
    "kits": {
        "image": "kits.jpg",
        "stadium": "ملعب نادي MUTINY ( ) بسعة ( ) مشجع.",
        "kits_images": [
            {"image": "kits1.jpg", "name": "الطقم الأول"},
            {"image": "kits2.jpg", "name": "الطقم الثاني"},
            {"image": "kits3.jpg", "name": "الطقم الثالث"},
            {"image": "kits4.jpg", "name": "طقم الحراس"}
        ]
    }
}

@app.route("/")
def home():
    return render_template("index.html", data=data)

if __name__ == "__main__":
    app.run(debug=True)
